

import classes from './main.module.css';
import React from 'react';
import { useState } from 'react';
import Parg from '../parg/Parg'


/**
 * the function shows two parg one with inline style css and the two in clasess css
 * @returns Parg
 */
export default function Main() {
  return (
    <main className={classes.main}>
    <Parg/>
    </main>
  );
}
/*    תפקידו של מאין גיאסאקס הוא לקשר את כל הספריות והקבצים בפרוייקט שלנו כדי שהתוכנית ריאקט תעבוד כראוי אנחנו לא מתעסקים בקובץ זה כי הוא נועד להפעיל את האייפייפי ולהפעיל את ריאקט דום שהיא חבילה שמאפשרת לנו לתקשר עם הדפדפן ומספקת לנו את הכלים הנחוצים לרינדר ריכיבי ריאקאט בדפדפן */

/*  פרופס קיימים כי אנחנו יכולים את הערכים מבחוץ הם משמשים להעברת מידע בין רכיבים  כאשר רוצים להעביר מידע או פונקציות מרכיב הורה לבן אז משתמשים ב פרופס והם יכולים להיות גמישים ושמישים על ידי העברת מידע שונה בכל שימוש בהם*/

/*הטיפוס טייפ של פרופס זה טיפוס של הורה לרכיב ילד ומאפשר לרכיב להיות דינאמי*/

/* תפקידה של אינטרפולציה זה שאנחנו שמים משתנים לדוגמא שהתצוגה מתעדכנת לבד אנחנו לא צריכים לעשות רענן או כל דבר אחר כדי לראות תצוגה היא משתנה תוך כדי כמו USESTATE */

/*התצוגה מתעדכנת כאשר אנחנו משתמשים בUSE STATE ובUSEEFFECT שהם תוך כדי הרצה משנים לנו את התצוגה  */